In [1]:
import pandas as pd
import numpy as np

In [3]:
arr = ([869, 374, 569, 197],
      [578, 286, 427, 89],
      [321, 148, 335, 66])

df = pd.DataFrame(arr, 
                  index=['서울지점','부산지점','제주지점'], 
                  columns=['컴퓨터','모니터','노트북','스마트폰'])

df

      컴퓨터  모니터  노트북  스마트폰
서울지점  869  374  569   197
부산지점  578  286  427    89
제주지점  321  148  335    66

In [5]:
df.loc['서울지점']

컴퓨터     869
모니터     374
노트북     569
스마트폰    197
Name: 서울지점, dtype: int64

In [7]:
df.iloc[1]

컴퓨터     578
모니터     286
노트북     427
스마트폰     89
Name: 부산지점, dtype: int64

In [13]:
df.컴퓨터

서울지점    869
부산지점    578
제주지점    321
Name: 컴퓨터, dtype: int64

In [10]:
df[['노트북']]

      노트북
서울지점  569
부산지점  427
제주지점  335

In [15]:
arr = (['서울지점', 869, 374, 569, 197],
      ['부산지점', 578, 286, 427, 89],
      ['제주지점', 321, 148, 335, 66])

df = pd.DataFrame(arr, 
                  columns=['지점명', '컴퓨터','모니터','노트북','스마트폰'])

df

    지점명  컴퓨터  모니터  노트북  스마트폰
0  서울지점  869  374  569   197
1  부산지점  578  286  427    89
2  제주지점  321  148  335    66

In [17]:
df.컴퓨터[0]

869

In [18]:
df[['지점명', '노트북']]

    지점명  노트북
0  서울지점  569
1  부산지점  427
2  제주지점  335

In [19]:
df.지점명

0    서울지점
1    부산지점
2    제주지점
Name: 지점명, dtype: object

In [20]:
df.set_index('지점명', inplace=True)

In [21]:
df

      컴퓨터  모니터  노트북  스마트폰
지점명
서울지점  869  374  569   197
부산지점  578  286  427    89
제주지점  321  148  335    66

In [22]:
df['스마트폰'] = 0

In [23]:
df

      컴퓨터  모니터  노트북  스마트폰
지점명
서울지점  869  374  569     0
부산지점  578  286  427     0
제주지점  321  148  335     0

In [26]:
df.loc['서울지점', '스마트폰'] = 197

In [27]:
df.loc['서울지점', '스마트폰']

197

In [43]:
df.iloc[2, 3] = 66

In [44]:
df

      컴퓨터  모니터  노트북  스마트폰
지점명
서울지점  869  374  569   197
부산지점  578  286  427     0
제주지점  321  148  335    66